# DataFrames in PANDAS

 Creating DataFrames with Lists

In [1]:
import pandas as pd

In [4]:
ls= [1,2,3,4]
df= pd.DataFrame(ls)
df

   0
0  1
1  2
2  3
3  4

In [6]:
ls2 = [[1,2,3,4],[4,5,6,7],[5,2,5,7]]
df2 = pd.DataFrame(ls2)
df2

   0  1  2  3
0  1  2  3  4
1  4  5  6  7
2  5  2  5  7

Creating DF from Dictionaries

In [20]:
ls3 = ({'Roll_no':[1,2,3,4]})
df3 = pd.DataFrame(ls3)
df3

   Roll_no
0        1
1        2
2        3
3        4

In [48]:
ls4 = {'name':['kp','pk','rs','jp'],'room_no':[11,32,13,27],'Roll_no':[1,2,3,4]}
df4 = pd.DataFrame(ls4)
df4

  name  room_no  Roll_no
0   kp       11        1
1   pk       32        2
2   rs       13        3
3   jp       27        4

In [39]:
ls5 = ({'a':4,'b':5},{'a':2,'b':9},{'a':0,'b':1})
df5 = pd.DataFrame(ls5)
df5

   a  b
0  4  5
1  2  9
2  0  1

In [54]:
ls5_1 = ({'a':4,'b':5},{'a':2,'b':9,'c':33},{'a':0,'b':1})
df5_1 = pd.DataFrame(ls5_1)
df5_1

   a  b     c
0  4  5   NaN
1  2  9  33.0
2  0  1   NaN

Creating DataFrames with a Dictionary madeup of Series

In [47]:
ls6 = {'ID':pd.Series([1,6,2,5]),'Rn':[11,12,13,14],'Pwd':pd.Series(['03','19','17','22'])}
df6 = pd.DataFrame(ls6)
df6

   ID  Rn Pwd
0   1  11  03
1   6  12  19
2   2  13  17
3   5  14  22